In [1]:
import os
import numpy as np
import pandas as pd
from sqlalchemy import create_engine
os.makedirs('Data/', exist_ok=True)

In [2]:
os.listdir("Data/")

['title-akas-us-only.csv', 'title.basics.tsv.gz', 'title.ratings.tsv.gz']

In [3]:
basics_url = "Data/basics.csv"
ratings_url = "./Data/title.ratings.tsv/data.tsv"

title_basics = pd.read_csv(basics_url, low_memory=False)
ratings = pd.read_csv(ratings_url, sep="\t", low_memory=False)

FileNotFoundError: [Errno 2] No such file or directory: 'Data/basics.csv'

In [ ]:
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,start_year,endYear,runtime,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,0,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,0,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,0,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,0,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,0,126,Drama

In [ ]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root"
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [ ]:
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [ ]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109425 entries, 0 to 109424
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         109425 non-null  object
 1   titleType      109425 non-null  object
 2   primaryTitle   109425 non-null  object
 3   originalTitle  109425 non-null  object
 4   isAdult        109425 non-null  int64
 5   start_year     109425 non-null  int64
 6   endYear        109425 non-null  int64
 7   runtime        109425 non-null  int64
 8   genres         109425 non-null  object
dtypes: int64(4), object(5)
memory usage: 7.5+ MB

In [ ]:
# find any start_years that have non-int characters
title_basics['start_year'].unique()

array([2001, 2020, 2018, 2005, 2002, 2017, 2006, 2004, 2000, 2009, 2003,
       2008, 2007, 2022, 2023, 2011, 2019, 2021, 2010, 2012, 2013, 2015,
       2016, 2014, 2024, 2026, 2027, 2025, 2030, 2029, 2028, 2031],
      dtype=int64)

In [ ]:
title_basics['start_year'] = title_basics['start_year'].replace('\\N', '0')

In [ ]:
title_basics['start_year'] = pd.to_numeric(title_basics['start_year'], errors='raise', downcast='integer')

In [ ]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109425 entries, 0 to 109424
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         109425 non-null  object
 1   titleType      109425 non-null  object
 2   primaryTitle   109425 non-null  object
 3   originalTitle  109425 non-null  object
 4   isAdult        109425 non-null  int64
 5   start_year     109425 non-null  int16
 6   endYear        109425 non-null  int64
 7   runtime        109425 non-null  int64
 8   genres         109425 non-null  object
dtypes: int16(1), int64(3), object(5)
memory usage: 6.9+ MB

In [ ]:
# # title_basics["Date"] = pd.to_datetime(title_basics["start_year"], errors='ignore').dt.strftime('%Y')


# title_basics['start_year'] = title_basics['start_year'].apply(lambda x: pd.to_datetime(str(x), format='%Y', errors='coerce'))
# title_basics['start_year'] = pd.to_numeric(title_basics['start_year'], errors='coerce')

In [ ]:
# title_basics['start_year'].unique().value_counts()
title_basics['start_year']

0         2001
1         2020
2         2018
3         2005
4         2002
          ...
109420    2019
109421    2019
109422    2020
109423    2020
109424    2019
Name: start_year, Length: 109425, dtype: int16

In [ ]:
title_basics['runtime'].astype('str').str.len().max()

4

In [ ]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109425 entries, 0 to 109424
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         109425 non-null  object
 1   titleType      109425 non-null  object
 2   primaryTitle   109425 non-null  object
 3   originalTitle  109425 non-null  object
 4   isAdult        109425 non-null  int64
 5   start_year     109425 non-null  int16
 6   endYear        109425 non-null  int64
 7   runtime        109425 non-null  int64
 8   genres         109425 non-null  object
dtypes: int16(1), int64(3), object(5)
memory usage: 6.9+ MB

In [ ]:
title_basics['primaryTitle'].astype('str').str.len().max()

242

In [ ]:
title_basics['runtime'].describe()

count    109425.000000
mean         79.143496
std          48.693155
min           0.000000
25%          70.000000
50%          90.000000
75%         101.000000
max        7200.000000
Name: runtime, dtype: float64

In [ ]:
title_basics['runtime'] = title_basics['runtime'].replace('\\N', 0)
# title_basics['runtime'] = pd.to_numeric(title_basics['runtime'], errors='raise', downcast='integer')

In [ ]:
q = ''' DESCRIBE genres'''
pd.read_sql(q, conn)

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [ ]:
q = ''' DESCRIBE ratings '''
pd.read_sql(q, conn)

             Field    Type Null Key Default Extra
0           tconst    text  YES        None
1   average_rating  double  YES        None
2  number_of_votes  bigint  YES        None

In [ ]:
q = ''' DESCRIBE title_genres '''
pd.read_sql(q, conn)

                 Field Type Null  Key Default Extra
0  title_basics_tconst  int   NO  PRI    None
1      genres_genre_id  int   NO  PRI    None

In [ ]:
q = '''
    SHOW TABLES
'''

# q = ''' DESCRIBE title_basics '''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

## Weird extra column

* I don't know where this ratings_tconst columns came from. I killed the query below at like 1500+ seconds, and in workbench I get this error:

![png](workbench-error.png)

In [ ]:
# Runs forever

# q = '''
#     ALTER TABLE movies.title_basics
#     DROP COLUMN ratings_tconst
# '''
# try
#     pd.read_sql(q, conn)
# except Exception as e:
#     print(e)

## Loading data into the tables

### Ratings

In [ ]:
q = ''' DESCRIBE ratings '''
describe_ratings = pd.read_sql(q, conn)
describe_ratings

             Field    Type Null Key Default Extra
0           tconst    text  YES        None
1   average_rating  double  YES        None
2  number_of_votes  bigint  YES        None

In [ ]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1988
1  tt0000002            5.8       265
2  tt0000003            6.5      1849
3  tt0000004            5.5       178
4  tt0000005            6.2      2632

In [ ]:
ratings = ratings.rename(columns={'averageRating':'average_rating', 'numVotes':'number_of_votes'})

### Title Basics

In [ ]:
q = ''' SELECT * FROM movies.title_basics'''
describe_title_basics = pd.read_sql(q, conn)
describe_title_basics

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126
...,...,...,...,...
109420,tt9915872,The Last White Witch,2019,97
109421,tt9916170,The Rehearsal,2019,51
109422,tt9916190,Safeguard,2020,95
109423,tt9916362,Coven,2020,92
109424,tt9916428,The Secret of China,2019,0

In [ ]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109425 entries, 0 to 109424
Data columns (total 9 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         109425 non-null  object
 1   titleType      109425 non-null  object
 2   primaryTitle   109425 non-null  object
 3   originalTitle  109425 non-null  object
 4   isAdult        109425 non-null  int64
 5   start_year     109425 non-null  int16
 6   endYear        109425 non-null  int64
 7   runtime        109425 non-null  int64
 8   genres         109425 non-null  object
dtypes: int16(1), int64(3), object(5)
memory usage: 6.9+ MB

In [ ]:
title_basics = title_basics.rename(columns={'primaryTitle': 'primary_title'})

In [ ]:
title_basics.loc[:,['tconst', 'primary_title', 'start_year', 'runtime']]

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126
...,...,...,...,...
109420,tt9915872,The Last White Witch,2019,97
109421,tt9916170,The Rehearsal,2019,51
109422,tt9916190,Safeguard,2020,95
109423,tt9916362,Coven,2020,92
109424,tt9916428,The Secret of China,2019,0

In [ ]:
small_title_basics = title_basics.loc[:,['tconst', 'primary_title', 'start_year', 'runtime']]
small_title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109425 entries, 0 to 109424
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         109425 non-null  object
 1   primary_title  109425 non-null  object
 2   start_year     109425 non-null  int16
 3   runtime        109425 non-null  int64
dtypes: int16(1), int64(1), object(2)
memory usage: 2.7+ MB

In [ ]:
small_title_basics.to_sql("title_basics", conn, index=False, if_exists="replace")

109425

In [ ]:
q = ''' DESCRIBE title_basics '''
pd.read_sql(q, conn)

           Field      Type Null Key Default Extra
0         tconst      text  YES        None
1  primary_title      text  YES        None
2     start_year  smallint  YES        None
3        runtime    bigint  YES        None

In [ ]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1331492 entries, 0 to 1331491
Data columns (total 3 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   tconst           1331492 non-null  object
 1   average_rating   1331492 non-null  float64
 2   number_of_votes  1331492 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 30.5+ MB

In [ ]:
ratings.to_sql("ratings", conn, index=False, if_exists="replace")

1331492

## Confirming it all worked

In [ ]:
q = ''' SHOW TABLES '''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [ ]:
q = ''' DESCRIBE title_basics '''
pd.read_sql(q, conn)

           Field      Type Null Key Default Extra
0         tconst      text  YES        None
1  primary_title      text  YES        None
2     start_year  smallint  YES        None
3        runtime    bigint  YES        None

In [ ]:
q = ''' SELECT * FROM title_basics LIMIT 5 '''
pd.read_sql(q, conn)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [ ]:
q = ''' DESCRIBE genres '''
pd.read_sql(q, conn)

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [ ]:
q = ''' SELECT * FROM genres LIMIT 5 '''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [genre_id, genre_name]
Index: []

In [ ]:
q = ''' DESCRIBE ratings '''
pd.read_sql(q, conn)

             Field    Type Null Key Default Extra
0           tconst    text  YES        None
1   average_rating  double  YES        None
2  number_of_votes  bigint  YES        None

In [ ]:
q = ''' SELECT * FROM ratings LIMIT 5 '''
pd.read_sql(q, conn)

      tconst  average_rating  number_of_votes
0  tt0000001             5.7             1988
1  tt0000002             5.8              265
2  tt0000003             6.5             1849
3  tt0000004             5.5              178
4  tt0000005             6.2             2632

In [ ]:
q = ''' DESCRIBE title_genres '''
pd.read_sql(q, conn)

                 Field Type Null  Key Default Extra
0  title_basics_tconst  int   NO  PRI    None
1      genres_genre_id  int   NO  PRI    None

In [ ]:
q = ''' SELECT * FROM title_genres LIMIT 5 '''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [title_basics_tconst, genres_genre_id]
Index: []